基礎/通用命令
===
[返回目錄](../../index.md)

## keys *
> 遍歷所有key
* **一般不在生產環境中使用**
* 多用在**熱備從節點(2-2)**及**scan**上
* 時間複雜度 O(n)
```redis=
> set hello world
OK
> set js good
OK
> keys *
1) "hello"
2) "js"
> dbsize
(integer) 2
```
### `keys [pattern]`
> 使用通配符查找
```redis=
# 通配符類似於正則
keys he*
keys he[h-l]*
keys ph?
```

## dbsize
> 計算 key 的總數
* 時間複雜度 O(1)

## exists key 
> 檢查 key 是否存在
* 僅返回 0 與 1
* 時間複雜度 O(1)
```redis=
> set a b
OK
> exists a
(integer) 1
> del a
(integer) 1
> exists a
(integer) 0
```

## get key
> 返回 key 的 value
* 時間複雜度 O(1)
```redis=
> set hello world
OK
> get hello
"world"
> get aaa
(nil)
```

## del key [key ...]
> 刪除指定的 key-value
* 返回刪除個數
* 時間複雜度 O(1)
```redis=
> set a b
OK
> get a
"b"
> del a
(integer) 1
> get a
(nil)
> del k1 k2 k3
(integer) 0
```

## expire key seconds
> key 在 seconds 秒後過期
* 時間複雜度 O(1)
```redis=
> set h w
OK
> expire h 10
(integer) 1
> ttl h
(integer) 9
> ttl h
(integer) 6
> persist h
(integer) 1
> ttl h
(integer) -1
> expire h 5
(integer) 1
> keys h
(empty list or set)
```

## ttl key
> 查看 key 剩餘的過期時間
* 返回剩餘秒數，特例：-1 key 存在且無剩餘過期時間、-2 key 已不存在
* 時間複雜度 O(1)

## persist key
> 去除 key 的過期時間
* 返回去除的 key 個數
* 時間複雜度 O(1)

## type key
> 返回 key 的類型
* 返回的類型有
	* string, hash, list, set, zset
	* none 不存在的 key
* 時間複雜度 O(1)
```redis=
> set a b
OK
> type b
string
> sadd myset 123
(integer) 3
> type myset
set
```